# 15. Memecah nilai string dari suatu kolom kedalam beberapa kolom baru

In [1]:
# Import the Pandas package
import pandas as pd

## Persiapan `DataFrame`

In [3]:
data = {
    "Nama": ["Didi Kempot", "Glenn Fredly", "Mbah Surip", "Ali Asghor"],
    "Tempat_Kelahiran": ["Surakarta, Jawa Tengah", "Jakarta, DKI Jakarta", "Mojokerto, Jawa Timur", "Jakarta, DKI Jakarta"]
}

df = pd.DataFrame(data)
df

           Nama        Tempat_Kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur
3    Ali Asghor    Jakarta, DKI Jakarta

## Memecah Nama depan dan Nama belakang

In [4]:
df[["Nama_Depan", "Nama_Belakang"]] = df["Nama"].str.split(" ", expand=True)
df

           Nama        Tempat_Kelahiran Nama_Depan Nama_Belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip
3    Ali Asghor    Jakarta, DKI Jakarta        Ali        Asghor

## Memecah Nama Kota dan Nama Provinsi

In [5]:
df[["Kota", "Provinsi"]] = df["Tempat_Kelahiran"].str.split(",", expand=True)
df

,Nama,Tempat_Kelahiran,Nama_Depan,Nama_Belakang,Kota,Provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur
3,Ali Asghor,"Jakarta, DKI Jakarta",Ali,Asghor,Jakarta,DKI Jakarta